app/Views/main/dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `tb_suratmasuk`
WHERE `diterima` = '2023-07-18'
---
        <div class="inner">
          <?php
          $db = \Config\Database::connect();
          $totalsuratditerimatoday = $db->table('tb_suratmasuk')->where('diterima', date('Y-m-d'))->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tb_suratmasuk`
WHERE `surat_kembali` = '1'
AND  `tgl_kembali` LIKE '%2023-07-18%' ESCAPE '!'
---
        <div class="inner">
          <?php
          $db = \Config\Database::connect();
          $totalsuratkembalitoday = $db->table('tb_suratmasuk')->where('surat_kembali', '1')->like('tgl_kembali', date('Y-m-d'))->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tb_suratmasuk`
WHERE `surat_kembali` = '1'
---
        <div class="inner">
          <?php
          $db = \Config\Database::connect();
          $totalsuratkembali = $db->table('tb_suratmasuk')->where('surat_kembali', '1')->countAllResults();