app/Controllers/Input.php

    public function index()
    {
        $data = [
            'tampilexpedisi' => $this->expedisi->findAll(),
            'tampilpenerima' => $this->penerima->findAll(),
            'tampilsatker' => $this->satker->findAll()
        ];
---
SELECT *
FROM `tb_expedisi`
SELECT *
FROM `tb_penerima`
SELECT *
FROM `tb_satker`