app/Controllers/Main.php

    public function index()
    {

        // diterimaAll();
        // diterimaHariIni();
        $modelSuratMasuk = new ModelSuratMasuk();
        $result = $modelSuratMasuk->select('sum(jml_surat) as jml_surat')->first();
---
SELECT sum(jml_surat) as jml_surat
FROM `tb_suratmasuk`
 LIMIT 1