app/Models/ModelSuratMasuk.php

SELECT *
FROM `tb_suratmasuk`
ORDER BY `diterima` DESC, `jam_diterima` DESC
---
    function tampildata()
    {
        return $this->table('tb_suratmasuk')->orderBy('diterima DESC, jam_diterima DESC')->get();